# Ejercicios Pair Programming - Módulo 2 Sprint 1
## Lección 1 - Pandas I
### Noemi Azorin y Silvia Gordón

In [1]:
import pandas as pd
import numpy as np
import random

El objetivo de la clase de hoy será crear unos cuántos DataFrames y Series a través de los siguientes ejercicios:

1.- ¿Qué diferencia hay entre una Serie y un DataFrame?

Una serie es unidimensional y un dataframe mínimo tiene que tener 2 dimensiones.

2.- Momento de trabajar con Series. Contestad a las siguientes preguntas:

Crea dos listas:

Una que se llame "valores" que tenga 7 números aleatorios.

Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

In [2]:
# Para crear una lista de 7 números aleatorios hemos importado la librería random
# Donde utilizamos random.sample es que nos devuelve lo que le especifiquemos dentro.

valores =random.sample(range(0, 10), 7)
valores

[8, 9, 2, 4, 3, 5, 6]

In [3]:
indices = ["Lunes","Martes","Miercoles","Jueves","Viernes","Sabado","Domingo"]
indices

['Lunes', 'Martes', 'Miercoles', 'Jueves', 'Viernes', 'Sabado', 'Domingo']

A partir de estas dos listas cread una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

In [4]:
serie1 = pd.Series(valores, index=indices)
serie1

Lunes        8
Martes       9
Miercoles    2
Jueves       4
Viernes      3
Sabado       5
Domingo      6
dtype: int64

A partir de las dos listas anteriores cread un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez. Más informción sobre este método .

In [5]:
diccionario_series = {k:v for k,v in zip(indices,valores)}
diccionario_series

{'Lunes': 8,
 'Martes': 9,
 'Miercoles': 2,
 'Jueves': 4,
 'Viernes': 3,
 'Sabado': 5,
 'Domingo': 6}

Crea una Serie con el diccionario creado en el punto anterior.

In [6]:
serie2 = pd.Series(diccionario_series)
serie2

Lunes        8
Martes       9
Miercoles    2
Jueves       4
Viernes      3
Sabado       5
Domingo      6
dtype: int64

¿Qué forma tiene esta última Serie?
¿Qué tipo de datos tiene?
¿Qué tamaño tiene?
¿Cuáles son los índices de la Serie?
¿Y los values?

In [10]:
print(f"La forma de esta serie es: {serie2.shape}")
print(f"El tipo de datos de esta serie es: {serie2.dtype}")
print(f"El tamaño de esta serie es: {serie2.size}")
print(f"Los índices de esta serie son: {serie2.index}")
print(f"Los valores de esta serie son: {serie2.values}")

La forma de esta serie es: (7,)
El tipo de datos de esta serie es: int64
El tamaño de esta serie es: 7
Los índices de esta serie son: Index(['Lunes', 'Martes', 'Miercoles', 'Jueves', 'Viernes', 'Sabado',
       'Domingo'],
      dtype='object')
Los valores de esta serie son: [8 9 2 4 3 5 6]

Extraed el valor para el índice "lunes"

In [19]:
serie2["Lunes"]

8

Extraed el valor para el índice "lunes", "martes" y "miércoles".

Modo Uno: a través de los índices.

In [17]:
serie2[["Lunes","Martes","Miercoles"]]

Lunes        8
Martes       9
Miercoles    2
dtype: int64

Modo Dos: a través de la posición.

In [14]:
serie2[0:3]

Lunes        8
Martes       9
Miercoles    2
dtype: int64

Extraed el valor para el índice "lunes" y "domingo".

In [21]:
serie2[["Lunes","Domingo"]]

Lunes      8
Domingo    6
dtype: int64

3.- Es el turno de los DataFrames

Cread un array de dos dimensiones con 4 filas y 3 columnas.

In [31]:
array_dos_dim = np.random.randint(0,10,(4,3))
array_dos_dim

array([[1, 4, 5],
       [1, 6, 2],
       [9, 3, 9],
       [8, 1, 7]])

Convertid el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

In [36]:
array_dt = pd.DataFrame(array_dos_dim, columns=["España", "Francia", "Italia"])
array_dt

   España  Francia  Italia
0       1        4       5
1       1        6       2
2       9        3       9
3       8        1       7

Descargad el archivo "medallas" y cargad el DataFrame con la siguiente línea de código:
df = pd.read_csv("medallas.csv", index_col=["País"])
📌 NOTA Para evitar problemas guardar el archivo medallas.csv a la misma altura (en la misma carpeta) que el jupyter donde estamos trabajando.

In [58]:
df = pd.read_csv("medallas.csv", index_col=["País"])

Usando el loc extraed todas las columnas de la fila.

Usando el loc extraed todas las columnas de China e Irán.

Usando el loc extraed solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

In [57]:
#Entendemos que quiere visualizar todas las columnas y filas
df.loc[:,:]

                 Unnamed: 0   Oro  Plata  Bronce
País
China                     1  1473    994     720
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

In [56]:
df.loc[["China","Irán"],:]

       Unnamed: 0   Oro  Plata  Bronce
País
China           1  1473    994     720
Irán            4   179    181     197

In [59]:
df.loc[["China","Irán"],["Oro","Plata","Bronce"]]

        Oro  Plata  Bronce
País
China  1473    994     720
Irán    179    181     197

Usando el iloc extraed la información de la India. Devolved todas las columnas.

Usando el iloc extraed todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

In [66]:
# Utilizamos el .loc para saber el índice que tiene India (en este caso es el 6)
df.loc["India"]

Unnamed: 0      6
Oro           154
Plata         202
Bronce        315
Name: India, dtype: int64

In [68]:
# Al saber que su índice es el 6, con iloc restamos uno ya que China es el 0.
df.iloc[5,:]

Unnamed: 0      6
Oro           154
Plata         202
Bronce        315
Name: India, dtype: int64

In [70]:
df.iloc[1::2]

                 Unnamed: 0   Oro  Plata  Bronce
País
Japón                     2  1032   1037     985
Irán                      4   179    181     197
India                     6   154    202     315
Indonesia                 8   112    131     240
Corea del Norte          10    91    120     235

Utilizando el código del ejercicio anterior, seleccionad unicamente las columnas "Oro", "Plata" y "Bronce".

In [73]:
df.loc[:,["Oro","Plata","Bronce"]]

                  Oro  Plata  Bronce
País
China            1473    994     720
Japón            1032   1037     985
Corea del Sur     745    663     827
Irán              179    181     197
Kazajistán        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China Taipéi       99    144     276
Corea del Norte    91    120     235

Contestad a las siguientes preguntas:

¿Qué país consiguió más de 200 medallas de oro?

In [75]:
df.loc[df.Oro > 200,:]

               Unnamed: 0   Oro  Plata  Bronce
País
China                   1  1473    994     720
Japón                   2  1032   1037     985
Corea del Sur           3   745    663     827

¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

In [77]:
df.loc[(df.Oro > 200) & (df.Plata > 1000),:]

       Unnamed: 0   Oro  Plata  Bronce
País
Japón           2  1032   1037     985

In [ ]:
¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

In [78]:
df.loc[(df.Oro > 200) | (df.Bronce > 700),:]

               Unnamed: 0   Oro  Plata  Bronce
País
China                   1  1473    994     720
Japón                   2  1032   1037     985
Corea del Sur           3   745    663     827

Como vemos hay una columna que se llama Unnamed: 0 que no nos interesa. Eliminad esa columna.

In [118]:
df = df.drop(df.columns[[0,0]], axis='columns')

In [119]:
df

                  Oro  Plata  Bronce
País
China            1473    994     720
Japón            1032   1037     985
Corea del Sur     745    663     827
Irán              179    181     197
Kazajistán        155    158     224
India             154    202     315
Tailandia         132    175     278
Indonesia         112    131     240
China Taipéi       99    144     276
Corea del Norte    91    120     235

Cread una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.